DataProcessors/СудебнаяСтадия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>СудебнаяСтадия</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанкротДолжник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УмерДолжник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОДолжника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКредитДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРожденияДолжника</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРожденияДолжника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДолжника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговораЦессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЦессии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервоначальныйКредитор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКредитногоДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКредита</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКредитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗадолженностиЗаявлено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗадолженностиРешСуда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрафы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Неустойка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Госпошлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлениеОбУступке</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлениеОСниженииПрцентов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСудебногоДела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Суды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСуда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Судья</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОПоручитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРожденияПоручителя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПоручителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРожденияПоручителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкротПоручитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УмерПоручитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаседания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСуд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудЗаседания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспртныеДанныеДолжника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКредита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСудебногоДела</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервоначальныйНомерКредитДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервоначальныйКредитор0</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/СудебнаяСтадия/Forms/ФормаВыборДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Создать(Команда)
	
	  Оповещение = Новый ОписаниеОповещения("Завершение", ЭтотОбъект); 
	
	 Если  РасширениеНазвания="о процессуальном правопреемстве" Тогда
	     
	       
	       
	       данныеСтруктура=Новый Структура;
		   данныеСтруктура.Вставить("ДоговорСтр",СсылкаДоговор);
		   данныеСтруктура.Вставить("ДолжникФИО",СсылкаДолжникФИО);
		   
		   данныеСтруктура.Вставить("ДатаРожденияДолжника",ДатаРожденияДолжника);
		   
		   данныеСтруктура.Вставить("АдресРегистрацииДолжника",АдресРегистрацииДолжника);
		   
		   данныеСтруктура.Вставить("ПаспортныеДанныеДолжника",ПаспортныеДанныеДолжника);
		   
		    данныеСтруктура.Вставить("ПаспортКемВыдан",ПаспортКемВыдан);
		   
		     данныеСтруктура.Вставить("ПаспортныеДанныеДолжникаДатаВыдачи",ПаспортДатаВыдачи);

		   
		   
		   
		   данныеСтруктура.Вставить("МестоРожденияДолжника",МестоРожденияДолжника);
		   данныеСтруктура.Вставить("НаименованиеПервоначальногоКредитора",НаименованиеПервоначальногоКредитора);
		   данныеСтруктура.Вставить("НомерДоговораЦессии",НомерДоговораЦессии);
		   
		   данныеСтруктура.Вставить("ДатаДоговораЦессии",ДатаДоговораЦессии);
		   
		   данныеСтруктура.Вставить("НомерКредитногоДоговора",НомерКредитногоДоговора);
		   
		   данныеСтруктура.Вставить("ДатаКредитногоДоговора",ДатаКредитногоДоговора);
		   
		   данныеСтруктура.Вставить("НазваниеСуда",НазваниеСуда);
		   
		   данныеСтруктура.Вставить("АдресСудаВкладка",АдресСудаВкладка);
		   
		   данныеСтруктура.Вставить("Исполнитель",Исполнитель);
		   
		   данныеСтруктура.Вставить("НомерСудебногоДела",НомерСудебногоДела); 
		   данныеСтруктура.Вставить("ДатаСудебногоДела",ДатаСудебногоДела); 
		   
		   
		   
		   
		   
		   
		   
			   
	       
	 	   ОткрытьФорму("Справочник.ЗаявлениеОПроцессуальномПравопреемстве.Форма.ФормаЭлемента",данныеСтруктура,,,,,Оповещение);

	 
	   КонецЕсли;
	   
	   
	   Если РасширениеНазвания="о выдаче судебного приказа"  Тогда
		   
              данныеСтруктура=Новый Структура;
		   данныеСтруктура.Вставить("ДоговорСтр",СсылкаДоговор);
		   данныеСтруктура.Вставить("ДолжникФИО",СсылкаДолжникФИО);
		   
		   данныеСтруктура.Вставить("ДатаРожденияДолжника",ДатаРожденияДолжника);
		   
		   данныеСтруктура.Вставить("АдресРегистрацииДолжника",АдресРегистрацииДолжника);
		   
		   данныеСтруктура.Вставить("ПаспортныеДанныеДолжника",ПаспортныеДанныеДолжника);
		   данныеСтруктура.Вставить("ПаспортКемВыдан",ПаспортКемВыдан);
		   
		     данныеСтруктура.Вставить("ПаспортныеДанныеДолжникаДатаВыдачи",ПаспортДатаВыдачи);

		   
		   данныеСтруктура.Вставить("МестоРожденияДолжника",МестоРожденияДолжника);
		   данныеСтруктура.Вставить("НаименованиеПервоначальногоКредитора",НаименованиеПервоначальногоКредитора);
		   данныеСтруктура.Вставить("НомерДоговораЦессии",НомерДоговораЦессии);
		   
		   данныеСтруктура.Вставить("ДатаДоговораЦессии",ДатаДоговораЦессии);
		   
		   данныеСтруктура.Вставить("НомерКредитногоДоговора",НомерКредитногоДоговора);
		   
		   данныеСтруктура.Вставить("ДатаКредитногоДоговора",ДатаКредитногоДоговора);
		   
		   данныеСтруктура.Вставить("НазваниеСуда",НазваниеСуда);
		   
		   данныеСтруктура.Вставить("АдресСудаВкладка",АдресСудаВкладка);
		   
		   данныеСтруктура.Вставить("Исполнитель",Исполнитель);
		   
           данныеСтруктура.Вставить("СуммаКредита",СуммаКредита); 
		   
		   данныеСтруктура.Вставить("НомерСудебногоДела",НомерСудебногоДела); 
		   данныеСтруктура.Вставить("ДатаСудебногоДела",ДатаСудебногоДела); 
		   
		   
		   данныеСтруктура.Вставить("ПервоначальныйНомерКредитДоговора",ПервоначальныйНомерКредитДоговора); 
		   данныеСтруктура.Вставить("ПервоначальныйКредитор0",ПервоначальныйКредитор0); 
		   
		   
		   
		   ОткрытьФорму("Справочник.ЗаявлениеОВыдачеСудебногоПриказа.Форма.ФормаЭлемента",данныеСтруктура,,,,,Оповещение);
	   	
	   
	   КонецЕсли;
	   
	   
	 
	
КонецПроцедуры


&НаКлиенте
Процедура Завершение(ЗавершениеЗакрыть, Параметры) Экспорт

	
  	
   ЭтаФорма.Закрыть();
  
  
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	  СсылкаДоговор= Параметры.ДоговорСсылка;
	  СсылкаДолжникФИО=Параметры.ДолжникФИО;
	  ДатаРожденияДолжника=Параметры.ДолжникДатаРожд;
	  АдресРегистрацииДолжника=Параметры.ДолжникАдоес;
	  ПаспортныеДанныеДолжника=Параметры.ДолжникПаспорт;
	  ПаспортДатаВыдачи=Параметры.ДолжникПаспортДатаВыдачи;
	  ПаспортКемВыдан=Параметры.ПаспортКемВыдан;
	  
	  МестоРожденияДолжника=Параметры.ДолжникМестоРождения;
	  НаименованиеПервоначальногоКредитора= Параметры.Кредитор;
	  НомерДоговораЦессии=Параметры.НомерДоговораЦессии;
	  ДатаДоговораЦессии=Параметры.ДатаЦессии;
	  
	  НомерКредитногоДоговора=Параметры.НомерКредитногоДоговора;
	  
	  ДатаКредитногоДоговора=Параметры.ДатаКредитногоДоговора;
	  
	  НазваниеСуда=Параметры.НазваниеСуда;
	  АдресСудаВкладка=Параметры.АдресСудаВкладка;
	  Исполнитель=Параметры.Исполнитель;
	  
	  СуммаКредита=Параметры.СуммаКредита;
	  
	  
	  НомерСудебногоДела=Параметры.НомерСудебногоДела;
	  
	  ДатаСудебногоДела=Параметры.ДатаСудебногоДела;
	  
	  
	  ПервоначальныйКредитор0=Параметры.ПервоначальныйКредитор0;
	  
	  ПервоначальныйНомерКредитДоговора=Параметры.ПервоначальныйНомерКредитДоговора;
	  
	  
	  
	  
	  
	
	
КонецПроцедуры

&НаКлиенте
Процедура НазваниеДокументаПриИзменении(Элемент)
	
	 Если НазваниеДокумента="ЗАЯВЛЕНИЕ"  Тогда
		 Элементы.РасширениеНазвания.СписокВыбора.Очистить();
		 Элементы.РасширениеНазвания.СписокВыбора.Вставить(0,"о процессуальном правопреемстве");
		 Элементы.РасширениеНазвания.СписокВыбора.Вставить(1,"о выдаче судебного приказа");
		 Элементы.РасширениеНазвания.СписокВыбора.Вставить(2,"о предоставлении копии судебного акта");
		 
		 Элементы.РасширениеНазвания.СписокВыбора.Вставить(3,"в суд о возврате госпошлины");
		 Элементы.РасширениеНазвания.СписокВыбора.Вставить(4,"в УФНС о возврате госпошлины");
		 Элементы.РасширениеНазвания.СписокВыбора.Вставить(5,"об оставлении предмета залога за собой");
		 Элементы.РасширениеНазвания.СписокВыбора.Вставить(6,"о выдаче исполнительного листа");
	 
	 КонецЕсли;
	 
	 Если НазваниеДокумента="ЖАЛОБА"  Тогда
		 
		 
		 Элементы.РасширениеНазвания.СписокВыбора.Очистить();
		 Элементы.РасширениеНазвания.СписокВыбора.Вставить(0,"частная");
		 Элементы.РасширениеНазвания.СписокВыбора.Вставить(1,"апелляционная");
		 Элементы.РасширениеНазвания.СписокВыбора.Вставить(2,"кассационная");
		 
		 //Элементы.РасширениеНазвания.СписокВыбора.Вставить(3,"в суд о возврате госпошлины");
	 КонецЕсли;
	 
	 
	  Если НазваниеДокумента="ОТВЕТ"  Тогда
		 
		 
		 Элементы.РасширениеНазвания.СписокВыбора.Очистить();
		 Элементы.РасширениеНазвания.СписокВыбора.Вставить(0,"на запрос суда");
		 Элементы.РасширениеНазвания.СписокВыбора.Вставить(1,"на определение об оставлении заявления/иска без движения ");
		
	 КонецЕсли;

	 
	  Если НазваниеДокумента="ВОЗРАЖЕНИЕ"  Тогда
		 
		 
		 Элементы.РасширениеНазвания.СписокВыбора.Очистить();
		 Элементы.РасширениеНазвания.СписокВыбора.Вставить(0,"на частную жалобу");
		 Элементы.РасширениеНазвания.СписокВыбора.Вставить(1,"на кассационную жалобу");
		 Элементы.РасширениеНазвания.СписокВыбора.Вставить(2,"на отзыв финансового уполномоченного");
		 
		
	 КонецЕсли;

	 
	 
	 
	 
	 
	 
	 
	 
	 
КонецПроцедуры
